Autodesk.Revit.DB.ForgeSchemaClosure.GetBindings
Returns the bindings.

Autodesk.Revit.DB.ForgeSchemaClosure.GetDependencies
Returns the dependencies.
A collection of all schemas that the primary schema depends upon, directly or indirectly. Each schema in this
map is indexed by its identifier.

Autodesk.Revit.DB.ForgeSchemaClosure.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ForgeSchemaClosure.IsHidden
Is parameter hidden.

Autodesk.Revit.DB.ForgeSchemaClosure.IsInstance
Parameter's instance vs type.

Autodesk.Revit.DB.ForgeSchemaClosure.GroupTypeId
Parameter's group typeId.

Autodesk.Revit.DB.ForgeSchemaClosure.Schema
The primary schema.

Autodesk.Revit.DB.ForgeSchemaClosure.TypeId
The primary schema's identifier.

Autodesk.Revit.DB.ForgeSchemaClosure.#ctor(System.String,System.String,System.Collections.Generic.IDictionary{System.String,System.String},System.Collections.Generic.IList{System.String},System.String,System.Boolean,System.Boolean)
Constructs a ForgeTypeId holding the given schema identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ForgeSchemaClosure
Contains a Forge schema with the full closure of other schemas that it depends upon.